import numpy as np
import matplotlib.pyplot as plt

# Задаем данные
n = [10, 20, 50, 100]
times = [[0.0941, 0.0758, 0.0712, 0.2697, 0.0805],
         [0.3935, 0.5374, 0.4231, 0.5592, 0.4801],
         [5.6365, 5.7859, 6.2985, 6.5246, 5.2811],
         [44.0427, 42.2208, 42.5902, 42.9874, 46.2117]]

# Среднее время для каждого количества вершин
mean_times = [np.mean(times[i]) for i in range(len(times))]

# Строим график
plt.plot(n, mean_times)
plt.xlabel('Количество вершин')
plt.ylabel('Время (мс)')
plt.title('Зависимость времени от количества вершин')
plt.show()
